# GetTemporaryViewPropertiesName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetTemporaryViewPropertiesName Method
View Class See Also
---
When Temporary View Properties mode is in progress, name of applied template is returned. Outside Temporary View Properties mode, empty string will be returned.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string GetTemporaryViewPropertiesName()
```

Visual Basic
---
```text
Public Function GetTemporaryViewPropertiesName As String
```

Visual C++
---
```text
public:
String^ GetTemporaryViewPropertiesName()
```

# See Also
View Class
Autodesk.Revit.DB Namespace